---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
SchemaBuilder Methods
SchemaBuilder Class See Also Send Feedback
---

The SchemaBuilder type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | AcceptableName | Checks whether a string is an acceptable name for a Schema or a Field. |
|  | AddArrayField | Creates a field containing an array of values in the Schema, with given name and type of contained values. |
|  | AddMapField | Creates a field containing an ordered key-value map in the Schema, with given name and type of contained values. |
|  | AddSimpleField | Creates a field containing a single value in the Schema, with given name and type. |
|  | Dispose |  |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
|  | Finish | Registers and returns the created Schema object. |
|  | GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object.) |
|  | GUIDIsValid | Checks whether the supplied GUID value is valid. |
|  | Ready | Checks whether the builder may be used. |
|  | SetApplicationGUID | Sets the GUID of the application or add-in that may access entities of this Schema under the Application acess level. |
|  | SetDocumentation | Sets the documentation string for the Schema. |
|  | SetReadAccessLevel | Sets top level read access (for entities) |
|  | SetSchemaName | Sets the name of the Schema. |
|  | SetVendorId | Sets the ID of the third-party vendor that may access entities of this Schema under the Vendor acess level, and to generally identify the owner of this Schema. |
|  | SetWriteAccessLevel | Sets top level write access (for entities) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object.) |
|  | VendorIdIsValid | Checks whether the given vendor ID string is valid. A valid vendor ID string: 1\. Has a length of at least 4 characters and no more than 253 characters, and 2\. Contains only letters, digits, or any of the following special characters: ! " # & \ ( ) + , . - : ; < = > ? _ ` | ~ |

# See Also

SchemaBuilder Class

Autodesk.Revit.DB.ExtensibleStorage Namespace